//************************************************************
//  Copyright (c) 深圳市赛元微电子有限公司
//	文件名称	: sc95f8x1x_wdt.c
//	作者		: 
//	模块功能	: WDT固件库函数C文件
//	局部函数列表:
//  最后更正日期: 2019/7/10
// 	版本		: V1.0 
//  说明        ：  
//*************************************************************

#include "sc95f8x1x_wdt.h"

/**************************************************
*函数名称：void WDT_DeInit(void)
*函数功能：WDT相关寄存器复位至缺省值
*入口参数：void
*出口参数：void
**************************************************/
void WDT_DeInit(void)
{
	WDTCON = 0X00;	
}

/**************************************************
*函数名称：void WDT_Init(WDT_OverflowTime_TypeDef OverflowTime)
*函数功能：WDT初始化配置函数
*入口参数：OverflowTime	WDT溢出时间选择
*出口参数：void
**************************************************/
void WDT_Init(WDT_OverflowTime_TypeDef OverflowTime)
{	
	WDTCON = (WDTCON & 0XF8) | OverflowTime; 	
}

/*****************************************************
*函数名称：void WDT_SetReload(void)
*函数功能：WDT喂狗
*入口参数：void
*出口参数：void
*****************************************************/
void WDT_SetReload(void)
{
	WDTCON |= 0X10;	
} 